package ru.gb.philosophers;
/*
Есть пять философов (потоки), которые могут либо обедать (выполнение кода) либо размышлять (ожидание).
● Каждый философ должен пообедать три раза. Каждый прием пищи длиться 500 миллисекунд
● После каждого приема пищи философ должен размышлять
● Не должно возникнуть общей блокировки
● Философы не должны есть больше одного раза подряд
 */
public class Main {
    public static void main(String[] args) {
        DinnerTable dinnerTable = new DinnerTable();
        dinnerTable.start();
    }
}
